//Sayfa 181 - 400

var sure = [
	"سورة الأنفال",
	"سورة التوبة",
	"سورة يونس",
	"سورة هود",
	"سورة يوسف",
	"سورة الرّعد",
	"سورة إبراهيم",
	"سورة الحجر",
	"سورة النحل",
	"سورة الإسراء",
	"سورة الكهف",
	"سورة مريم",
	"سورة طه",
	"سورة الأنبياء",
	"سورة الحج",
	"سورة المؤمنون",
	"سورة النّور",
	"سورة الفرقان",
	"سورة الشعراء",
	"سورة النمل",
	"سورة القصص",
	"سورة العنكبوت"
];

var enfal_ilk_ayet = 41;
var ayet_sayisi = [ 35,129,109,123,111,43,52,99,128,111,110,98,135,112,78,118,64,77,227,93,88,45 ]; //ankebut 69 ayet 45 yapıldı (sayfa 400) -- enfal 75 ayet 35 yapıldı (s. 201)

var sayfa = [ 176,186,207,220,234,248,254,261,268,281,292,304,311,321,331,341,349,358,366,376,384,395 ];

var vedduha_mulk_amme = [	
	"نَبَإ</br>عَمَّ يَتَسَاءَلُونَ</br>…</br>وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا",
	"نَبَإ</br>عَنِ النَّبَإِ الْعَظِيمِ</br>…</br>وَجَعَلْنَا اللَّيْلَ لِبَاسًا",
	"نَبَإ</br>الَّذِي هُمْ فِيهِ مُخْتَلِفُونَ</br>…</br>وَجَعَلْنَا النَّهَارَ مَعَاشًا",
	"نَبَإ</br>كَلَّا سَيَعْلَمُونَ</br>…</br>وَجَعَلْنَا النَّهَارَ مَعَاشًا",
	"نَبَإ</br>ثُمَّ كَلَّا سَيَعْلَمُونَ</br>…</br>وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا",
	"نَبَإ</br>أَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا</br>…</br>وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا",
	"نَبَإ</br>وَالْجِبَالَ أَوْتَادًا</br>…</br>وَأَنزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا",
	"نَبَإ</br>وَخَلَقْنَاكُمْ أَزْوَاجًا</br>…</br>وَأَنزَلْنَا مِنَ الْمُعْصِرَاتِ مَاءً ثَجَّاجًا",
	"نَبَإ</br>وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا</br>…</br>لِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا",
	"نَبَإ</br>وَجَعَلْنَا اللَّيْلَ لِبَاسًا</br>…</br>وَجَنَّاتٍ أَلْفَافًا",
	"نَبَإ</br>وَجَعَلْنَا النَّهَارَ مَعَاشًا</br>…</br>إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا",
	"نَبَإ</br>وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا</br>…</br>فَتَأْتُونَ أَفْوَاجًا",
	"نَبَإ</br>وَجَعَلْنَا سِرَاجًا وَهَّاجًا</br>…</br>وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا",
	"نَبَإ</br>وَأَنزَلْنَا مِنَ الْمُعْصِرَاتِ</br>…</br>وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا",
	"نَبَإ</br>لِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا</br>…</br>إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا",
	"نَبَإ</br>وَجَنَّاتٍ أَلْفَافًا</br>…</br>لِلطَّاغِينَ مَآبًا",
	"نَبَإ</br>إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا</br>…</br>لَابِثِينَ فِيهَا أَحْقَابًا",
	"نَبَإ</br>يَوْمَ يُنفَخُ فِي الصُّورِ</br>…</br>لَا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا",
	"نَبَإ</br>وَفُتِحَتِ السَّمَاءُ فَكَانَتْ أَبْوَابًا</br>…</br>إِلَّا حَمِيمًا وَغَسَّاقًا",
	"نَبَإ</br>وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا</br>…</br>إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا",
	"نَبَإ</br>إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا</br>…</br>وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا",
	"نَبَإ</br>لِلطَّاغِينَ مَآبًا</br>…</br>وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا",
	"نَبَإ</br>لَابِثِينَ فِيهَا أَحْقَابًا</br>…</br>وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا",
	"نَبَإ</br>لَا يَذُوقُونَ فِيهَا بَرْدًا</br>…</br>فَذُوقُوا فَلَنْ نَزِيدَكُمْ إِلَّا عَذَابًا",
	"نَبَإ</br>إِلَّا حَمِيمًا وَغَسَّاقًا</br>…</br>إِنَّ لِلْمُتَّقِينَ مَفَازًا",
	"نَبَإ</br>جَزَاءً وِفَاقًا</br>…</br>حَدَائِقَ وَأَعْنَابًا",
	"نَبَإ</br>إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا</br>…</br>وَكَوَاعِبَ أَتْرَابًا",
	"نَبَإ</br>وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا</br>…</br>لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا",
	"نَبَإ</br>وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا</br>…</br>جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا",
	"نَبَإ</br>فَذُوقُوا فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا</br>…</br>رَبِّ السَّمَاوَاتِ وَالْأَرْضِ",
	"نَبَإ</br>إِنَّ لِلْمُتَّقِينَ مَفَازًا</br>…</br>وَمَا بَيْنَهُمَا الرَّحْمَـٰنِ",
	"نَبَإ</br>حَدَائِقَ وَأَعْنَابًا</br>…</br>لَا يَمْلِكُونَ مِنْهُ خِطَابًا",
	"نَبَإ</br>وَكَوَاعِبَ أَتْرَابًا</br>…</br>لَا يَمْلِكُونَ مِنْهُ خِطَابًا",
	"نَبَإ</br>وَكَأْسًا دِهَاقًا</br>…</br>يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا",
	"نَبَإ</br>لَا يَسْمَعُونَ فِيهَا لَغْوًا</br>…</br>لَا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ",
	"نَبَإ</br>جَزَاءً مِن رَبِّكَ عَطَاءً حِسَابًا</br>…</br>مَنْ أَذِنَ لَهُ الرَّحْمَـٰنُ وَقَالَ صَوَابًا",
	"نَبَإ</br>رَبِّ السَّمَاوَاتِ وَالْأَرْضِ</br>…</br>فَمَن شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ مَآبًا",
	"نَبَإ</br>يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ</br>…</br>يَا لَيْتَنِي كُنْتُ تُرَابًا",
	"ضـحى</br>سورة الضـحى",
	"ضـحى</br>سورة الانشراح",
	"ضـحى</br>سورة الـتين",
	"ضـحى</br>سورة الـقدر",
	"ضـحى</br>سورة الزلزال",
	"ضـحى</br>سورة الـعاديات",
	"ضـحى</br>سورة الـقارعـة",
	"ضـحى</br>سورة الـتكاثر",
	"ضـحى</br>سورة الـعصر",
	"ضـحى</br>سورة الـهمزة",
	"ملك</br>تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ </br>…</br>هَلْ تَرَى مِن فُطُورٍ",
	"ملك</br>الَّذِي خَلَقَ الْمَوْتَ</br>…</br>ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنقَلِبْ",
	"ملك</br>الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ </br>…</br>وَلَقَدْ زَيَّنَّا السَّمَاء الدُّنْيَا بِمَصَابِيحَ ",
	"ملك</br>ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ </br>…</br>عَذَابُ جَهَنَّمَ وَبِئْسَ الْمَصِيرُ",
	"ملك</br>وَلَقَدْ زَيَّنَّا السَّمَاء الدُّنْيَا </br>…</br>شَهِيقًا وَهِيَ تَفُورُ",
	"ملك</br>وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ</br>…</br>قَالُوا بَلَى قَدْ جَاءَنَا نَذِيرٌ",
	"ملك</br>إِذَا أُلْقُوا فِيهَا سَمِعُوا </br>…</br>إِنْ أَنتُمْ إِلاَّ فِي ضَلالٍ كَبِيرٍ",
	"ملك</br>تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ </br>…</br>وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ",
	"ملك</br>قَالُوا بَلَى قَدْ جَاءَنَا</br>…</br>فَسُحْقًا لِّأَصْحَابِ السَّعِيرِ",
	"ملك</br>وَقَالُوا لَوْ كُنَّا نَسْمَعُ </br>…</br>وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ",
	"ملك</br>فَاعْتَرَفُوا بِذَنبِهِمْ فَسُحْقًا</br>…</br>أَلا يَعْلَمُ مَنْ خَلَقَ",
	"ملك</br>إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُم</br>…</br>هُوَ الَّذِي جَعَلَ لَكُمُ الأَرْضَ",
	"ملك</br>وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ </br>…</br>فِي مَنَاكِبِهَا وَكُلُوا مِن رِّزْقِهِ",
	"ملك</br>أَلا يَعْلَمُ مَنْ خَلَقَ </br>…</br>فَإِذَا هِيَ تَمُورُ",
	"ملك</br>هُوَ الَّذِي جَعَلَ لَكُمُ الأَرْضَ </br>…</br>أَمْ أَمِنتُم مَّن فِي السَّمَاء",
	"ملك</br>أَأَمِنتُم مَّن فِي السَّمَاء</br>…</br>فَكَيْفَ كَانَ نَكِيرِ",
	"ملك</br>أَمْ أَمِنتُم مَّن فِي السَّمَاء</br>…</br>صَافَّاتٍ وَيَقْبِضْنَ",
	"ملك</br>وَلَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ </br>…</br>يَنصُرُكُم مِّن دُونِ الرَّحْمَنِ",
	"ملك</br>أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ </br>…</br>أَمَّنْ هَذَا الَّذِي يَرْزُقُكُمْ",
	"ملك</br>أَمَّنْ هَذَا الَّذِي هُوَ جُندٌ </br>…</br>عَلَى وَجْهِهِ أَهْدَى أَمَّن يَمْشِي",
	"ملك</br>أَمَّنْ هَذَا الَّذِي يَرْزُقُكُمْ </br>…</br>وَجَعَلَ لَكُمُ السَّمْعَ وَالأَبْصَارَ",
	"ملك</br>أَفَمَن يَمْشِي مُكِبًّا </br>…</br>قُلْ هُوَ الَّذِي ذَرَأَكُمْ",
	"ملك</br>قُلْ هُوَ الَّذِي أَنشَأَكُمْ</br>…</br>قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ ",
	"ملك</br>قُلْ هُوَ الَّذِي ذَرَأَكُمْ </br>…</br>فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ",
	"ملك</br>وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ </br>…</br>وَقِيلَ هَذَا الَّذِي كُنتُم بِهِ تَدَّعُونَ",
	"ملك</br>قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ </br>…</br>إِنْ أَهْلَكَنِيَ اللَّهُ وَمَن مَّعِيَ",
	"ملك</br>فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ </br>…</br>قُلْ هُوَ الرَّحْمَنُ آمَنَّا بِهِ",
	"ملك</br>قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ </br>…</br>قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ",

	"علق</br>اِقْرَأْ بِاسْمِ رَبِّكَ</br>…</br>اَنْ رَاٰهُ اسْتَغْنٰى",
	"علق</br>خَلَقَ الْاِنْسَانَ مِنْ عَلَقٍ</br>…</br>اِنَّ اِلٰى رَبِّكَ الرُّجْعٰى",
	"علق</br>اِقْرَأْ وَرَبُّكَ الْاَكْرَمُ</br>…</br>عَبْدًا اِذَا صَلّٰى",
	"علق</br>اَلَّذِي عَلَّمَ بِالْقَلَمِ</br>…</br>اَرَاَيْتَ اِنْ كَانَ عَلَى الْهُدٰى",
	"علق</br>عَلَّمَ الْاِنْسَانَ مَا لَمْ يَعْلَمْ</br>…</br>اَوْ اَمَرَ بِالتَّقْوٰى",
	"علق</br>كَلَّا اِنَّ الْاِنْسَانَ لَيَطْغٰى</br>…</br>اَرَاَيْتَ اِنْ كَذَّبَ وَتَوَلّٰى",
	"علق</br>اَنْ رَاٰهُ اسْتَغْنٰى</br>…</br>اَلَمْ يَعْلَمْ بِاَنَّ اللّٰهَ يَرٰى",
	"علق</br>اِنَّ اِلٰى رَبِّكَ الرُّجْعٰى</br>…</br>كَلَّا لَئِنْ لَمْ يَنْتَهِ",
	"علق</br>اَرَاَيْتَ الَّذي يَنْهٰى</br>…</br>لَنَسْفَعًا بِالنَّاصِيَةِ",
	"علق</br>عَبْدًا اِذَا صَلّٰى</br>…</br>نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ",
	"علق</br>اَرَاَيْتَ اِنْ كَانَ عَلَى الْهُدٰى</br>…</br>فَلْيَدْعُ نَادِيَهُ",
	"علق</br>اَوْ اَمَرَ بِالتَّقْوٰى</br>…</br>سَنَدْعُ الزَّبَانِيَةَ",
	"علق</br>اَرَاَيْتَ اِنْ كَذَّبَ وَتَوَلّٰى</br>…</br>كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِبْ",
	
	"بينة</br>لَمْ يَكُنِ الَّذِينَ كَفَرُوا</br>…</br>مَا جَاءَتْهُمُ الْبَيِّنَةُ",
	"بينة</br>رَسُولٌ مِنَ اللّٰهِ يَتْلُوا</br>…</br>وَذٰلِكَ دِينُ الْقَيِّمَةِ",
	"بينة</br>فِيهَا كُتُبٌ قَيِّمَةٌ </br>…</br>اِنَّ الَّذِينَ كَفَرُوا مِنْ اَهْلِ الْكِتَابِ",
	"بينة</br>وَمَا تَفَرَّقَ الَّذِينَ اُوتُوا الْكِتَابَ</br>…</br>وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ",
	"بينة</br>وَمَا اُمِرُوا اِلَّا لِيَعْبُدُوا اللّٰهَ</br>…</br>اُولٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ",
	"بينة</br>اِنَّ الَّذِينَ كَفَرُوا مِنْ اَهْلِ الْكِتَابِ</br>…</br>خَالِدِينَ فِيهَا اَبَدًا",
	"بينة</br>اِنَّ الَّذِينَ اٰمَنُوا</br>…</br>ذٰلِكَ لِمَنْ خَشِيَ رَبَّهُ"

];

var tecvid_sual = [
	"تجويدك  تعريفى نه در؟",
	"تجويدك غايه سى نه در؟",
	"تجويدك  موضوعى نه در؟",
	"تجويدك حكمى نه در؟ واضعى كيمدر؟",
	"قاراباش تجويدينك مصنفى كيمدر؟",
	"سببِ مد نه يه ديرلر و قاجدر؟",
	"مدِّ طبيعى نه يه  ديرلر؟ مرتبه سى و حكمى نه در ؟",
	"مدّ متّصل  نه يه ديرلر حكمى نه در؟",
	"قرائت إماممز و بزم راوى مز  كيمدر؟",
	"مدى منفصل نه يه ديرلر حكمى نه در ؟",
	"مدّ لازم نه يه ديرلر حكمى نه در وقاج تورلودر؟",
	"سكون لازم نه يه ديرلر؟  و سكون عارض نه يه ديرلر ؟",
	"مدّ عارض  نه يه ديرلر؟ حكمى نه در؟",
	"روم  و اشمامك تعريفى نه د؟",
	"مدِّ لين نه يه ديرلر؟",
	"اخفانك  تعريفى نه در؟   وحرفلرى نه لردر؟",
	"اظهارك تعريفى  نه در ؟ و حرفلرى  نه لردر؟",
	"اقلابك تعريفى  نه در؟",
	"إدغام مع الغنّه  نه يه ديرلر؟",
	"إدغام بلاغنّه  نه يه ديرلر؟",
	"إدغام  مثلينك تعريفى  نه در؟",
	"نون ساكن نونه اوغراديغى زمان نه اولور ؟",
	"ميم ساكنك قاچ حالى واردر؟",
	"إدغام متجانسينك تعريفى  نه در؟ حرفلرى قاج مخرجده در ؟",
	"إدغام متقاربينك تعريفى نه در؟ حرفلرى قاچ مخرجده در؟",
	"إدغام شمسيه نك حرفلرى نه لردر؟",
	"اظهار قمريه نك حرفلرى نه لردر؟",
	"قلقله نك تعريفى  نه در؟ و حرفلرى نه لردر؟",
	"حروف استعلا نه لردر؟",
	"سكته نك تعريفى نه در؟ و قرآن كريمده قاچ يرده در؟",
	"قرآن كريم قاچ شكيلده اوقونور؟",
	"إماله نه در؟  إمام عاصم حضرتلرينه كوره هانكى كلمه ده در؟",
	"تسهيل نه در؟  قرأن كريمده  امام عاصم حضرتلرينه كوره واجب اولان تسهيل هانكى كلمه ده در؟"
]

/*
var mulk = [
	"هَلْ تَرَى مِن فُطُورٍ</br>…</br>تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ",
	"ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ يَنقَلِبْ</br>…</br>الَّذِي خَلَقَ الْمَوْتَ",
	"وَلَقَدْ زَيَّنَّا السَّمَاء الدُّنْيَا بِمَصَابِيحَ </br>…</br>الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ",
	"عَذَابُ جَهَنَّمَ وَبِئْسَ الْمَصِيرُ</br>…</br>ثُمَّ ارْجِعِ الْبَصَرَ كَرَّتَيْنِ",
	"شَهِيقًا وَهِيَ تَفُورُ</br>…</br>وَلَقَدْ زَيَّنَّا السَّمَاء الدُّنْيَا",
	"قَالُوا بَلَى قَدْ جَاءَنَا نَذِيرٌ</br>…</br>وَلِلَّذِينَ كَفَرُوا بِرَبِّهِمْ",
	"إِنْ أَنتُمْ إِلاَّ فِي ضَلالٍ كَبِيرٍ</br>…</br>إِذَا أُلْقُوا فِيهَا سَمِعُوا",
	"وَقَالُوا لَوْ كُنَّا نَسْمَعُ أَوْ نَعْقِلُ</br>…</br>تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ",
	"فَسُحْقًا لِّأَصْحَابِ السَّعِيرِ</br>…</br>قَالُوا بَلَى قَدْ جَاءَنَا",
	"وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ</br>…</br>وَقَالُوا لَوْ كُنَّا نَسْمَعُ",
	"أَلا يَعْلَمُ مَنْ خَلَقَ</br>…</br>فَاعْتَرَفُوا بِذَنبِهِمْ فَسُحْقًا",
	"هُوَ الَّذِي جَعَلَ لَكُمُ الأَرْضَ</br>…</br>إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُم",
	"فِي مَنَاكِبِهَا وَكُلُوا مِن رِّزْقِهِ</br>…</br>وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوا بِهِ",
	"فَإِذَا هِيَ تَمُورُ</br>…</br>أَلا يَعْلَمُ مَنْ خَلَقَ",
	"أَمْ أَمِنتُم مَّن فِي السَّمَاء</br>…</br>هُوَ الَّذِي جَعَلَ لَكُمُ الأَرْضَ",
	"فَكَيْفَ كَانَ نَكِيرِ</br>…</br>أَأَمِنتُم مَّن فِي السَّمَاء",
	"صَافَّاتٍ وَيَقْبِضْنَ</br>…</br>أَمْ أَمِنتُم مَّن فِي السَّمَاء",
	"يَنصُرُكُم مِّن دُونِ الرَّحْمَنِ</br>…</br>وَلَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ",
	"أَمَّنْ هَذَا الَّذِي يَرْزُقُكُمْ</br>…</br>أَوَلَمْ يَرَوْا إِلَى الطَّيْرِ فَوْقَهُمْ",
	"عَلَى وَجْهِهِ أَهْدَى أَمَّن يَمْشِي</br>…</br>أَمَّنْ هَذَا الَّذِي هُوَ جُندٌ",
	"وَجَعَلَ لَكُمُ السَّمْعَ وَالأَبْصَارَ</br>…</br>أَمَّنْ هَذَا الَّذِي يَرْزُقُكُمْ",
	"قُلْ هُوَ الَّذِي ذَرَأَكُمْ</br>…</br>أَفَمَن يَمْشِي مُكِبًّا",
	"قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ </br>…</br>قُلْ هُوَ الَّذِي أَنشَأَكُمْ",
	"فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ</br>…</br>قُلْ هُوَ الَّذِي ذَرَأَكُمْ",
	"وَقِيلَ هَذَا الَّذِي كُنتُم بِهِ تَدَّعُونَ</br>…</br>وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ",
	"إِنْ أَهْلَكَنِيَ اللَّهُ وَمَن مَّعِيَ</br>…</br>قُلْ إِنَّمَا الْعِلْمُ عِندَ اللَّهِ",
	"قُلْ هُوَ الرَّحْمَنُ آمَنَّا بِهِ</br>…</br>فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ",
	"قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ</br>…</br>قُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ"
];
*/
function convertDigitIn(enDigit){ // PERSIAN, ARABIC, URDO
    var newValue="";
    for (var i=0;i<enDigit.length;i++)
    {
        var ch=enDigit.charCodeAt(i);
        if (ch>=48 && ch<=57)
        {
            // european digit range
            var newChar=ch+1584;
            newValue=newValue+String.fromCharCode(newChar);
        }
        else
            newValue=newValue+String.fromCharCode(ch);
    }
    return newValue;
}

function shuffle(length, obj){
	var j, x, i;
	for (i = length; i; i--) {
		j = Math.floor(Math.random() * i);
		x = obj[i - 1];
		obj[i - 1] = obj[j];
		obj[j] = x;
	}
}

shuffle(tecvid_sual.length, tecvid_sual);
shuffle(vedduha_mulk_amme.length, vedduha_mulk_amme);

function ayet_sec(){
	/*var rand_sure_index = Math.floor(Math.random() * sure.length);
	
	var rand_ayet_index;
	if(rand_sure_index == 0) //eğer random sure ilk sure ise (enfal)
		rand_ayet_index = Math.floor(Math.random() * ayet_sayisi[rand_sure_index]) + enfal_ilk_ayet; //enfal suresinin 41. ayetinden sormaya başlıyoruz
	else
		rand_ayet_index = Math.floor(Math.random() * ayet_sayisi[rand_sure_index]);
	
	document.getElementById("mainText").innerHTML = sure[rand_sure_index] + "</br>" + "آ - " + convertDigitIn(rand_ayet_index.toString()) + "</br>" + "ص - " + convertDigitIn((sayfa[rand_sure_index]).toString()) ;
	//DEPRECATED */
	var sahife = Math.floor(Math.random() * 220) + 181; //sahife 181 - 400 (ikisi de dahil)
	var satir = Math.floor(Math.random() * 13) + 1; // satir 1 - 13 (ikisi de dahil)
	document.getElementById("mainText").innerHTML = convertDigitIn(sahife.toString()) + "</br>" + convertDigitIn(satir.toString());
	
}

var tecvid_index = 0;
function tecvid_sec(){
	if(tecvid_index == tecvid_sual.length)
		tecvid_index = 0;
	document.getElementById("mainText").innerHTML = tecvid_sual[tecvid_index];
	tecvid_index++;
}

/*
var mulk_index = 0;
function mulk_sec(){
	if(mulk_index == mulk.length)
		mulk_index = 0;
	document.getElementById("mainText").innerHTML = mulk[mulk_index];
	mulk_index++;
}*/

var ezber_index = 0;
function ezber_sec(){
	if(ezber_index == vedduha_mulk_amme.length)
		ezber_index = 0;
	document.getElementById("mainText").innerHTML = vedduha_mulk_amme[ezber_index];
	ezber_index++;
}